uhnp/src/AccountingRegisters/Хозрасчетный/Хозрасчетный.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccountingRegister>
  <name>Хозрасчетный</name>
  <chartOfAccounts>ChartOfAccounts.Хозрасчетный</chartOfAccounts>
  <correspondence>true</correspondence>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
    <balance>true</balance>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоПодразделениям</accountingFlag>
  </dimensions>
  <dimensions>
    <name>НаправлениеДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.УчетПоНаправлениямДеятельности</accountingFlag>
  </dimensions>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Валютный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Валютный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.Количественный</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Количественный</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаНУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаПР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаВР</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <accountingFlag>ChartOfAccounts.Хозрасчетный.AccountingFlag.НалоговыйУчет</accountingFlag>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаУУ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <resources>
    <name>СуммаФО</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
    <balance>true</balance>
    <extDimensionAccountingFlag>ChartOfAccounts.Хозрасчетный.ExtDimensionAccountingFlag.Суммовой</extDimensionAccountingFlag>
  </resources>
  <attributes>
    <name>Содержание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НеКорректироватьСтоимостьАвтоматически</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Сторно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:AccountingRegister>

uhnp/src/Enums/Периодичность/Периодичность.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Периодичность</name>
  <comment>(Упр)(-УХМодульМенеджера)</comment>
  <enumValues>
    <name>День</name>
  </enumValues>
  <enumValues>
    <name>Неделя</name>
  </enumValues>
  <enumValues>
    <name>Декада</name>
  </enumValues>
  <enumValues>
    <name>Месяц</name>
  </enumValues>
  <enumValues>
    <name>Квартал</name>
  </enumValues>
  <enumValues>
    <name>Полугодие</name>
  </enumValues>
  <enumValues>
    <name>Год</name>
  </enumValues>
  <enumValues>
    <name>ДевятьМесяцев</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Enums/ВариантыРасширенногоПервогоНалоговогоПериода/ВариантыРасширенногоПервогоНалоговогоПериода.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВариантыРасширенногоПервогоНалоговогоПериода</name>
  <enumValues>
    <name>НеПредусмотрен</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияВДекабре</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияВПоследние10ДнейКвартала</name>
  </enumValues>
  <enumValues>
    <name>РегистрацияВПоследнемКвартале</name>
  </enumValues>
  <enumValues>
    <name>МесяцПостановкиНаУчет</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/CommonModules/БухгалтерскийУчет/Module.bsl
#Область ПрограммныйИнтерфейс

#Область РаботаСоСчетамиИСубконто

// Снимает/устанавливает активность проводок документа (бух. учет).
//
// Параметры:
//	Документ - ДокументСсылка.* - Ссылка на документ, для которого меняется активность проводок.
//
Процедура ПереключитьАктивностьПроводокБУ(Документ) Экспорт
	
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПометкаУдаления") Тогда
		Возврат;
	КонецЕсли;

	ПроводкиДокумента = РегистрыБухгалтерии.Хозрасчетный.СоздатьНаборЗаписей();
	ПроводкиДокумента.Отбор.Регистратор.Установить(Документ);
	ПроводкиДокумента.Прочитать();

	КоличествоПроводок = ПроводкиДокумента.Количество();
	Если НЕ (КоличествоПроводок = 0) Тогда
		
		// Определяем текущую активность проводок по первой проводке
		ТекущаяАктивностьПроводок = ПроводкиДокумента[0].Активность;

		// Инвертируем текущую активность проводок
		ПроводкиДокумента.УстановитьАктивность(НЕ ТекущаяАктивностьПроводок);
		ОбщегоНазначенияБП.ПропуститьБизнесЛогикуПриЗаписи(ПроводкиДокумента);
		ПроводкиДокумента.Записать();

	КонецЕсли;
		
КонецПроцедуры // ПереключитьАктивностьПроводокБУ()

// Процедура устанавливает субконто на счете. Если такое субконто на счете
// отсутствует, то ничего не делается.
//
// Параметры:
//	Счет         - ПланСчетовСсылка.Хозрасчетный - Счет, к которому относится субконто.
//  Субконто     - РегистрБухгалтерииСубконто.Хозрасчетный - Набор субконто.
//	ИмяСубконто  - Строка, Число - Номер, имя или вид устанавливаемого субконто.
//  ЗначениеСубконто - Произвольный - Значение устанавливаемого субконто.
//
Процедура УстановитьСубконто(Счет, Субконто, ИмяСубконто, ЗначениеСубконто) Экспорт

	Если НЕ ЗначениеЗаполнено(ИмяСубконто) Тогда
		Возврат;
	КонецЕсли;
	
	СвойстваСчета = БухгалтерскийУчетВызовСервераПовтИсп.ПолучитьСвойстваСчета(Счет);
	
	Если ТипЗнч(ИмяСубконто) = Тип("Число") Тогда // номер субконто

		Если ИмяСубконто > СвойстваСчета.КоличествоСубконто Тогда
			Возврат;
		КонецЕсли;

		ВидСубконто = СвойстваСчета["ВидСубконто" + ИмяСубконто];

	Иначе // имя или вид субконто

		ВидСубконто = ?(ТипЗнч(ИмяСубконто) = Тип("ПланВидовХарактеристикСсылка.ВидыСубконтоХозрасчетные"),
						ИмяСубконто,
						ПланыВидовХарактеристик.ВидыСубконтоХозрасчетные[ИмяСубконто]);
		
		// Проверка, что указанный вид субконто есть на счете.
		Если СвойстваСчета.ВидСубконто1 <> ВидСубконто
		   И СвойстваСчета.ВидСубконто2 <> ВидСубконто
		   И СвойстваСчета.ВидСубконто3 <> ВидСубконто Тогда

			Возврат;
			
		КонецЕсли;

	КонецЕсли;
		
	Если ВидСубконто.ТипЗначения.СодержитТип(ТипЗнч(ЗначениеСубконто)) Тогда
		
		Субконто.Вставить(ВидСубконто, ЗначениеСубконто);
		
	КонецЕсли;

КонецПроцедуры // УстановитьСубконто()

// Процедура устанавливает в проводке подразделение на счете, если по нему ведется учет по подразделениям.
//
// Параметры:
//	Проводка - РегистрБухгалтерииЗапись.Хозрасчетный - Проводка, в которой нужно установить подразделение.
//  Подразделение - СправочникСсылка.ПодразделенияОрганизаций - Устанавливаемое подразделение.
//	ДтКт - Строка - Если "Дт", подразделение устанавливается по дебету проводки, иначе по кредиту.
//
Процедура УстановитьПодразделениеПроводки(Проводка, Подразделение, ДтКт = "Дт") Экспорт
	
	Если Проводка["Счет" + ДтКт].УчетПоПодразделениям Тогда
		Проводка["Подразделение" + ДтКт] = Подразделение;
	КонецЕсли;
	
КонецПроцедуры

// Процедура устанавливает в проводке подразделения, если по счетам дебета и кредита ведется учет по подразделениям.
//
// Параметры:
//	Проводка - РегистрБухгалтерииЗапись.Хозрасчетный - Проводка, в которой нужно установить подразделения.
// 	ПодразделениеДт - СправочникСсылка.ПодразделенияОрганизаций - Устанавливаемое подразделение по дебету.
// 	ПодразделениеКт - СправочникСсылка.ПодразделенияОрганизаций - Устанавливаемое подразделение по кредиту.
//
Процедура УстановитьПодразделенияПроводки(Проводка, ПодразделениеДт, ПодразделениеКт) Экспорт

	УстановитьПодразделениеПроводки(Проводка, ПодразделениеДт, "Дт");
	
	УстановитьПодразделениеПроводки(Проводка, ПодразделениеКт, "Кт");

КонецПроцедуры

// Дополняет переданные счета их субсчетами. Для всех счетов проверяется соответствие заданным условиям.
//
// Параметры:
//  МассивСчетов - Массив - список счетов, которые нужно дополнить субсчетами.
//  УсловияОтбора- Структура - см. НовыеУсловияОтбораСубсчетов().
//
// Возвращаемое значение:
//   Массив      - список исходных счетов плюс их субсчета.
//
Функция СформироватьМассивСубсчетовПоОтбору(МассивСчетов, УсловияОтбора = Неопределено) Экспорт

	Если УсловияОтбора = Неопределено Тогда
		УсловияОтбора = НовыеУсловияОтбораСубсчетов();
	КонецЕсли;
	
	УсловиеПоСчетам = ?(ЗначениеЗаполнено(МассивСчетов), "Хозрасчетный.Ссылка В ИЕРАРХИИ(&МассивСчетов)", "ИСТИНА");
	
	УсловиеПоИсключениям = ?(ЗначениеЗаполнено(УсловияОтбора.СчетаИсключения), "И НЕ Хозрасчетный.Ссылка В (&СчетаИсключения)", "");
	
	Если УсловияОтбора.ИспользоватьВПроводках = Неопределено Тогда
		УсловиеПоСчетамГруппам = "";
	Иначе
		УсловиеПоСчетамГруппам = "И " + ?(УсловияОтбора.ИспользоватьВПроводках, "НЕ ", "") + "Хозрасчетный.ЗапретитьИспользоватьВПроводках";
	КонецЕсли;
	
	Если УсловияОтбора.Валютный = Неопределено Тогда
		УсловиеПоВалютным = "";
	Иначе
		УсловиеПоВалютным = "И " + ?(УсловияОтбора.Валютный, "", "НЕ ") + "Хозрасчетный.Валютный";
	КонецЕсли; 
	
	Если УсловияОтбора.Забалансовый = Неопределено Тогда
		УсловиеПоЗабалансовым = "";
	Иначе
		УсловиеПоЗабалансовым = "И " + ?(УсловияОтбора.Забалансовый, "", "НЕ ") + "Хозрасчетный.Забалансовый";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивСчетов",    МассивСчетов);
	Запрос.УстановитьПараметр("СчетаИсключения", УсловияОтбора.СчетаИсключения);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Хозрасчетный.Ссылка
	|ИЗ
	|	ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	" + УсловиеПоСчетам + "
	|	" + УсловиеПоИсключениям + "
	|	" + УсловиеПоСчетамГруппам + "
	|	" + УсловиеПоВалютным + "
	|	" + УсловиеПоЗабалансовым + "
	|УПОРЯДОЧИТЬ ПО
	|	Хозрасчетный.Код
	|";
	
	МассивСчетовССубсчетами = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
	Возврат МассивСчетовССубсчетами;

КонецФункции

// Дополняет переданные счета их субсчетами. После первого вызова запоминает субсчета
// и при последующих вызовах не обращается к СУБД.
//
// Параметры:
//  МассивСчетов - Массив - список счетов, которые нужно дополнить субсчетами.
//
// Возвращаемое значение:
//   Массив      - список исходных счетов плюс их субсчета.
//
Функция СформироватьМассивСубсчетов(МассивСчетов) Экспорт

	МассивСубсчетов = Новый Массив;
	Для каждого СчетВерхнегоУровня Из МассивСчетов Цикл
	
		Субсчета = БухгалтерскийУчетПовтИсп.СчетаВИерархии(СчетВерхнегоУровня);
		ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивСубсчетов, Субсчета);
	
	КонецЦикла; 
	
	Возврат МассивСубсчетов;

КонецФункции // СформироватьМассивСубсчетов()

// Возвращает максимальное количество субконто на счете.
//
// Возвращаемое значение:
//	Число - Максимальное количество субконто.
//
Функция МаксимальноеКоличествоСубконто() Экспорт

	Возврат Метаданные.ПланыСчетов.Хозрасчетный.МаксКоличествоСубконто;

КонецФункции

// Задает набор возможных условий для отбора по списку счетов.
//
// Возвращаемое значение:
//	Структура - структура условий отбора по списку счетов.
//
Функция НовыеУсловияОтбораСубсчетов() Экспорт
	
	УсловияОтбора = Новый Структура;
	
	// флаги
	УсловияОтбора.Вставить("ИспользоватьВПроводках"); // отбор по ЗапретитьИспользоватьВПроводках
	УсловияОтбора.Вставить("Валютный");
	УсловияОтбора.Вставить("Забалансовый");
	
	// список исключаемых счетов
	УсловияОтбора.Вставить("СчетаИсключения");
	
	Возврат УсловияОтбора;
	
КонецФункции

#КонецОбласти

#Область ИсчислениеПериодов

// Определяет дату начала отчетного года для составления финансовой отчетности в соответствии с Законом "О БУХГАЛТЕРСКОМ
// УЧЕТЕ" N 402-ФЗ (6 декабря 2011 года).
//
// Статья 15
// 3. В случае, если государственная регистрация экономического субъекта, за исключением кредитной организации,
// произведена после 30 сентября, первым отчетным годом является, если иное не установлено экономическим субъектом,
// период с даты государственной регистрации по 31 декабря календарного года, следующего за годом его государственной
// регистрации, включительно.
// 
// Параметры:
//  Период		 - Дата - любая дата из отчетного года
//  Организация	 - СправочникСсылка.Организации - Организация, начало отчетного года которой нужно получить.
// 
// Возвращаемое значение:
//  Дата         - дата начала периода; как правило начало года, но может быть и датой регистрации организации
//  Неопределено - запрошен период ранее даты регистрации организации.
//
Функция НачалоОтчетногоГода(Период, Организация) Экспорт
	
	Возврат ИнтерфейсыВзаимодействияБРО.НачалоНалоговогоПериода(
		Организация,
		Период,
		ВариантРасширенногоПервогоНалоговогоПериода(),
		Перечисления.Периодичность.Год);
		
КонецФункции


// Определяет общепринятое представление периода в бухгалтерской (финансовой) отчетности.
// Период бухгалтерской отчетности всегда выражен целым числом месяцев с начала года,
// то есть, например, даже если в отчетность за первый год включаются данные с ноября 2024 по декабрь 2025,
// это отчетность "за 2025 год".
//
// Параметры:
//  Период - Дата - конец отчетного периода
//  КодЯзыка - Строка - код языка, например, для записи сообщений в информационную базу
//           - Неопределено - использовать язык пользователя
// 
// Возвращаемое значение:
//  Строка - представление периода
//
Функция ПредставлениеПериодаБухгалтерскойОтчетности(Период, КодЯзыка = Неопределено) Экспорт
	
	ЭлементыФорматнойСтроки = Новый Массив;
	Если КодЯзыка <> Неопределено Тогда
		ЭлементыФорматнойСтроки.Добавить(СтрШаблон("Л=%1", КодЯзыка));
	КонецЕсли;
	ЭлементыФорматнойСтроки.Добавить("ФП=Истина");
	
	Возврат ПредставлениеПериода(
		НачалоГода(Период),
		КонецМесяца(Период),
		СтрСоединить(ЭлементыФорматнойСтроки, ";"));
	
КонецФункции

#КонецОбласти 

 #Область МежотчетныйПериод

// Возвращает верхнюю границу уточнения периода исходя из заданной в метаданных длины уточнения периода.
//
// Возвращаемое значение:
//	Число
//
Функция ВерхняяГраницаУточненияПериода() Экспорт
	
	Возврат Pow(10, Метаданные.РегистрыБухгалтерии.Хозрасчетный.ДлинаУточненияПериода) - 1;
	
КонецФункции

// Проверяет наличие операций межотчетного периода на дату.
//
// Параметры:
//	Период - Дата
//	Организация - СправочникСсылка.Организации
//
// Возвращаемое значение:
//	Булево
//
Функция ЕстьОперацииМежотчетногоПериода(Период, Организация) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Хозрасчетный.СчетДт КАК СчетДт
	|ИЗ
	|	РегистрБухгалтерии.Хозрасчетный КАК Хозрасчетный
	|ГДЕ
	|	Хозрасчетный.Период = &Период
	|	И Хозрасчетный.УточнениеПериода > 0
	|	И Хозрасчетный.Организация = &Организация";
	
	Запрос.Параметры.Вставить("Период", КонецМесяца(Период));
	Запрос.Параметры.Вставить("Организация", Организация);
	
	Возврат Не Запрос.Выполнить().Пустой();
КонецФункции

#КонецОбласти

#Область ПервичныеДокументы

// Определяет в целом для сеанса работы, может ли потребоваться рассчитывать,
// заполнять и отображать пользователю суммы НУ в проводках.
// 
// Обращение к функции следует выполнять через кеш повтоно используемых значений -
// см. БухгалтерскийУчетВызовСервераПовтИсп.ПользователюДоступныСуммыНалогНаПрибыль()
// Она единообразно работает и с ПР/ВР, и с НУ.
// 
// Возвращаемое значение:
//  ПеречислениеСсылка.ВариантыРасширенногоПервогоНалоговогоПериода
//
Функция ВариантРасширенногоПервогоНалоговогоПериода() Экспорт
	Возврат Перечисления.ВариантыРасширенногоПервогоНалоговогоПериода.РегистрацияВПоследнемКвартале;
КонецФункции

// Определяет в целом для сеанса работы, может ли потребоваться рассчитывать,
// заполнять и отображать пользователю суммы НУ в проводках.
// 
// Обращение к функции следует выполнять через кеш повтоно используемых значений -
// см. БухгалтерскийУчетВызовСервераПовтИсп.ПользователюДоступныСуммыНалогНаПрибыль()
// Она единообразно работает и с ПР/ВР, и с НУ.
// 
// Возвращаемое значение:
//  Булево - Истина, если может потребоваться использовать суммы НУ в проводках.
//
Функция ПользователюДоступныСуммыНУ() Экспорт
	
	// Функциональные опции, привязанные к ресурсу периодического регистра сведений,
	// фактически могут быть использованы только при использовании Периода в качестве параметров функциональной опции.
	
	// Потому что значение функциональной опции вычисляется по срезу последних регистра и если период не передан,
	// то значение функциональной опции будет Истина только в том случае, когда на самый поздний момент значение ресурса Истина,
	// а не в том случае, когда в одной из записей значение ресурса Истина.
	
	// Поэтому здесь не обращаемся к функциональной опции, а обращаемся к данным регистра непосредственно.
	
	Возврат БухгалтерскийУчетПереопределяемый.ПользователюДоступныСуммыНУ();

КонецФункции

// Определяет в контексте отдельных операций, отчетов и т.п., нужно ли рассчитывать,
// заполнять и отображать пользователю суммы разниц в проводках.
//
// Параметры:
//  Организация - СправочникСсылка.Организации
//  Период      - Дата - дата, на которую проверяется значение настройки;
//                если не заполнена, то проверяется наиболее поздняя
//  ДоступныйВидИспользованияСумм - Строка - максимально возможный.
//                                  См. БухгалтерскийУчетВызовСервераПовтИсп.ПользователюДоступныСуммыНалогНаПрибыль()
// 
// Возвращаемое значение:
//   Строка - варианты использования разниц. См. БухгалтерскийУчетВызовСервераПовтИсп.ПользователюДоступныСуммыНалогНаПрибыль()
//
Функция ИспользоватьСуммыНалогНаПрибыль(Организация, Период, ДоступныйВидИспользованияСумм = "") Экспорт

	Возврат БухгалтерскийУчетПереопределяемый.ИспользоватьСуммыНалогНаПрибыль(
		Организация, Период, ДоступныйВидИспользованияСумм);
	
КонецФункции

// Настраивает поля учета разниц в форме, отображающей набор записей регистра Хозрасчетный.
//
// Параметры:
//  ПоляНалогНаПрибыль - Соответствие - ключ = поле формы, в том числе - заголовки строк; значение = вид учета НУ/ПР/ВР
//  ПоляЗаголовков - Структура - поля формы, отображающие заголовки колонок, содержащих показатели НУ, ПР, ВР:
//                    * Дт - ПолеФормы, ГруппаФормы -
//                    * Кт - ПолеФормы, ГруппаФормы -
//  Период         - Дата - основной период набора записей
//  Организация    - СправочникСсылка.Организации - организация набора записей
//                 - Неопределено - организация набора записей не может быть определена
//  ВалютаРУ       - СправочникСсылка.Валюты - Валюта регл. учета
//
Процедура НастроитьПоляУчетаРазниц(ПоляНалогНаПрибыль, ПоляЗаголовков, Период, Организация = Неопределено, ВалютаРУ = Неопределено) Экспорт
	
	БухгалтерскийУчетПереопределяемый.НастроитьПоляУчетаРазниц(ПоляНалогНаПрибыль, ПоляЗаголовков,
		Период, Организация, ВалютаРУ);
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
